nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/eth/processor/eth_p32mz1024efk064.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _ETH_P32MZ1024EFK064_H
#define _ETH_P32MZ1024EFK064_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    ETH_ID_0 = _ETH_BASE_ADDRESS,
    ETH_NUMBER_OF_MODULES = 1

} ETH_MODULE_ID;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/eth_PauseTimer_Default.h"
#include "../templates/eth_Enable_Default.h"
#include "../templates/eth_StopInIdle_Default.h"
#include "../templates/eth_TransmitRTS_Default.h"
#include "../templates/eth_ReceiveEnable_Default.h"
#include "../templates/eth_AutoFlowControl_Default.h"
#include "../templates/eth_ManualFlowControl_Default.h"
#include "../templates/eth_RxBufferCountDecrement_Default.h"
#include "../templates/eth_ReceiveBufferSize_Default.h"
#include "../templates/eth_TxPacketDescriptorAddress_Default.h"
#include "../templates/eth_RxPacketDescriptorAddress_Default.h"
#include "../templates/eth_HashTable_Default.h"
#include "../templates/eth_PatternMatch_Default.h"
#include "../templates/eth_RxFilterPatternMatch_Default.h"
#include "../templates/eth_ReceiveFilters_Default.h"
#include "../templates/eth_ReceiveWmarks_Default.h"
#include "../templates/eth_Interrupt_Default.h"
#include "../templates/eth_EthernetControllerStatus_Default.h"
#include "../templates/eth_ReceiveOverflowCount_Default.h"
#include "../templates/eth_FramesTransmittedOK_Default.h"
#include "../templates/eth_CollisionCounts_Default.h"
#include "../templates/eth_FramexReceivedOK_Default.h"
#include "../templates/eth_FCSErrorCount_Default.h"
#include "../templates/eth_AlignmentErrorCount_Default.h"
#include "../templates/eth_MAC_Resets_Default.h"
#include "../templates/eth_MAC_Configuration_Default.h"
#include "../templates/eth_InterPacketGaps_Default.h"
#include "../templates/eth_CollisionWindow_Default.h"
#include "../templates/eth_RetransmissionMaximum_Default.h"
#include "../templates/eth_MaxFrameLength_Default.h"
#include "../templates/eth_RMII_Support_Default.h"
#include "../templates/eth_MAC_Testing_Default.h"
#include "../templates/eth_MIIM_Config_Default.h"
#include "../templates/eth_MIIMScanMode_Default.h"
#include "../templates/eth_MIIMReadWrite_Default.h"
#include "../templates/eth_MIIMAddresses_Default.h"
#include "../templates/eth_MIIWriteReadData_Default.h"
#include "../templates/eth_MIIM_Indicators_Default.h"
#include "../templates/eth_StationAddress_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_ETH_PauseTimerSet(ETH_MODULE_ID index, uint16_t PauseTimerValue)
{
     ETH_PauseTimerSet_Default(index, PauseTimerValue);
}

PLIB_INLINE_API uint16_t PLIB_ETH_PauseTimerGet(ETH_MODULE_ID index)
{
     return ETH_PauseTimerGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsPauseTimer(ETH_MODULE_ID index)
{
     return ETH_ExistsPauseTimer_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_Enable(ETH_MODULE_ID index)
{
     ETH_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_Disable(ETH_MODULE_ID index)
{
     ETH_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_IsEnabled(ETH_MODULE_ID index)
{
     return ETH_IsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsEnable(ETH_MODULE_ID index)
{
     return ETH_ExistsEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_StopInIdleEnable(ETH_MODULE_ID index)
{
     ETH_StopInIdleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_StopInIdleDisable(ETH_MODULE_ID index)
{
     ETH_StopInIdleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_StopInIdleIsEnabled(ETH_MODULE_ID index)
{
     return ETH_StopInIdleIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsStopInIdle(ETH_MODULE_ID index)
{
     return ETH_ExistsStopInIdle_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxRTSEnable(ETH_MODULE_ID index)
{
     ETH_TxRTSEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxRTSDisable(ETH_MODULE_ID index)
{
     ETH_TxRTSDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TxRTSIsEnabled(ETH_MODULE_ID index)
{
     return ETH_TxRTSIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsTransmitRTS(ETH_MODULE_ID index)
{
     return ETH_ExistsTransmitRTS_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxEnable(ETH_MODULE_ID index)
{
     ETH_RxEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxDisable(ETH_MODULE_ID index)
{
     ETH_RxDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_RxIsEnabled(ETH_MODULE_ID index)
{
     return ETH_RxIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxEnable(ETH_MODULE_ID index)
{
     return ETH_ExistsRxEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_AutoFlowControlEnable(ETH_MODULE_ID index)
{
     ETH_AutoFlowControlEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_AutoFlowControlDisable(ETH_MODULE_ID index)
{
     ETH_AutoFlowControlDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_AutoFlowControlIsEnabled(ETH_MODULE_ID index)
{
     return ETH_AutoFlowControlIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsAutoFlowControl(ETH_MODULE_ID index)
{
     return ETH_ExistsAutoFlowControl_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ManualFlowControlEnable(ETH_MODULE_ID index)
{
     ETH_ManualFlowControlEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ManualFlowControlDisable(ETH_MODULE_ID index)
{
     ETH_ManualFlowControlDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ManualFlowControlIsEnabled(ETH_MODULE_ID index)
{
     return ETH_ManualFlowControlIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsManualFlowControl(ETH_MODULE_ID index)
{
     return ETH_ExistsManualFlowControl_Default(index);
}

